package com.company;

public class Main {

    public static void main(String[] args) {
	// write your code here
    }

    /**
     *  Для данного n возьмите сумму цифр n.
     *  Если это значение состоит из более чем одной цифры,
     *  продолжайте уменьшать таким образом, пока не будет получено однозначное число.
     *  Входными данными будет неотрицательное целое число.
     *
     *      16  -->  1 + 6 = 7
     *      942  -->  9 + 4 + 2 = 15  -->  1 + 5 = 6
     *      132189  -->  1 + 3 + 2 + 1 + 8 + 9 = 24  -->  2 + 4 = 6
     *      493193  -->  4 + 9 + 3 + 1 + 9 + 3 = 29  -->  2 + 9 = 11  -->  1 + 1 = 2
     *
     *      задание взято из сайта CodeWars и его пример
     *
     * ===================================================================================
     *      public class DRoot {
     *   public static int digital_root(int n) {
     *     // ... тут надо писать код который вернет значение
     *       }
     *      }
     * ====================================================================================
     */
}
